Vasconcelos_Wright_2011_Geysering/caseA_Dt57p1_Ha0305_Yfs0356/model/openfoam_3d_caseA/0.orig/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 105271.3;

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform 105271.3;
    }

    atmosphere
    {
        type            calculated;
        value           uniform 101325;
    }
}
