Vasconcelos_Wright_2011_Geysering/caseA_Dt57p1_Ha0305_Yfs0356/model/openfoam_3d_caseA/0.orig/p_rgh
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 105271.3;

boundaryField
{
    walls
    {
        type            fixedFluxPressure;
    }

    atmosphere
    {
        type            fixedValue;
        value           uniform 101333;
    }
}
