Vasconcelos_Wright_2011_Geysering/caseA_Dt57p1_Ha0305_Yfs0356/model/openfoam_3d_caseA/constant/g
FoamFile
{
    version     2.0;
    format      ascii;
    class       uniformDimensionedVectorField;
    object      g;
}

dimensions      [0 1 -2 0 0 0 0];
value           (0 -9.81 0);
