Vasconcelos_Wright_2011_Geysering/caseA_Dt57p1_Ha0305_Yfs0356/model/openfoam_3d_caseA/constant/thermophysicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}

phases          (water air);

pMin            50000;

sigma
{
    type        constant;
    sigma       0.072;
}
