Vasconcelos_Wright_2011_Geysering/caseA_Dt57p1_Ha0305_Yfs0356/model/openfoam_3d_caseA/constant/thermophysicalProperties.air
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight   28.965;
    }
    thermodynamics
    {
        Cp          1005;
        Hf          0;
    }
    transport
    {
        mu          1.81e-05;
        Pr          0.71;
    }
}
