Vasconcelos_Wright_2011_Geysering/caseA_Dt57p1_Ha0305_Yfs0356/model/openfoam_3d_caseA/constant/thermophysicalProperties.water
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectFluid;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight   18.01528;
    }
    equationOfState
    {
        R           2.2e6;
        rho0        998.2;
    }
    thermodynamics
    {
        Cp          4182;
        Hf          0;
    }
    transport
    {
        mu          1.003e-3;
        Pr          7.0;
    }
}
