Vasconcelos_Wright_2011_Geysering/caseA_Dt57p1_Ha0305_Yfs0356/model/openfoam_3d_caseA/system/blockMeshDict
/* Cartesian background mesh for snappyHexMesh. */
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (-0.018 -0.067 -0.072)
    ( 4.024 -0.067 -0.072)
    ( 4.024  0.677 -0.072)
    (-0.018  0.677 -0.072)
    (-0.018 -0.067  0.072)
    ( 4.024 -0.067  0.072)
    ( 4.024  0.677  0.072)
    (-0.018  0.677  0.072)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (337 62 12) simpleGrading (1 1 1)
);

edges ();

boundary
(
    background
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (1 2 6 5)
            (0 1 5 4)
            (3 7 6 2)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs ();
