Vasconcelos_Wright_2011_Geysering/caseA_Dt57p1_Ha0305_Yfs0356/model/openfoam_3d_caseA/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    caseAUnion.stl
    {
        type    triSurfaceMesh;
        name    walls;
    }
}

castellatedMeshControls
{
    maxLocalCells       3000000;
    maxGlobalCells      3000000;
    minRefinementCells  0;
    maxLoadUnbalance    0.10;
    nCellsBetweenLevels 2;

    features ();

    refinementSurfaces
    {
        walls
        {
            level       (1 1);
            patchInfo
            {
                type wall;
            }
        }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
        walls
        {
            mode        inside;
            levels      ((1e15 1));
        }
    }

    locationInMesh      (1.003 0.001 0.001);
    locationsOutsideMesh ((-0.01 0.65 0.06));
    allowFreeStandingZoneFaces false;
}

snapControls
{
    nSmoothPatch        5;
    tolerance           2.0;
    nSolveIter          50;
    nRelaxIter          8;
    nFeatureSnapIter    15;
    implicitFeatureSnap true;
    explicitFeatureSnap false;
    multiRegionFeatureSnap true;
}

addLayersControls
{
    relativeSizes              true;
    layers                     {};
    expansionRatio             1.0;
    finalLayerThickness        0.3;
    minThickness               0.1;
    nGrow                      0;
    featureAngle               60;
    slipFeatureAngle           30;
    nRelaxIter                 3;
    nSmoothSurfaceNormals      1;
    nSmoothNormals             3;
    nSmoothThickness           10;
    maxFaceThicknessRatio      0.5;
    maxThicknessToMedialRatio  0.3;
    minMedialAxisAngle         90;
    nBufferCellsNoExtrude      0;
    nLayerIter                 50;
}

meshQualityControls
{
    #includeEtc "caseDicts/meshQualityDict"
    nSmoothScale       4;
    errorReduction     0.75;
}

debug           0;
mergeTolerance  1e-6;
